Revit 2027 API
MechanicalUtils.ConnectDuctPlaceholdersAtElbow Method
Overload List
Name | Description
ConnectDuctPlaceholdersAtElbow(Document, Connector, Connector) |  Connects a pair of placeholders that can intersect in an Elbow connection.
ConnectDuctPlaceholdersAtElbow(Document, ElementId, ElementId) |  Connects a pair of placeholders that can intersect in an Elbow connection.
Top
See Also
Reference
MechanicalUtils Class
Autodesk.Revit.DB.Mechanical Namespace